#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/csepulveda_io/AWSBaseSetup/runs/run-wrfYC7V4gSEqMhKT

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.aws_static_website.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:107584640829:certificate/35d640b2-5ceb-4f89-88f3-889cde860c79]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-042664948f4bb4b4e]
module.aws_static_website.aws_s3_bucket.website_logs: Refreshing state... [id=csepulveda.io-logs]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=cluster120210624002121633900000002]
aws_route53_zone.primary: Refreshing state... [id=Z09309173TX5H4I19KYIU]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::107584640829:policy/cluster1-elb-sl-role-creation20210624002121619600000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121845200000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121871600000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121844100000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=cluster120210624002121633900000002-20210624002121846800000005]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0af3b9f319452df47]
module.aws_static_website.aws_route53_record.wildcard_validation["*.csepulveda.io"]: Refreshing state... [id=Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME]
module.aws_static_website.aws_route53_record.wildcard_validation["csepulveda.io"]: Refreshing state... [id=Z09309173TX5H4I19KYIU__b5d5fb2e388042f78fd19d630ef16304.csepulveda.io._CNAME]
module.aws_static_website.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-06-22 16:18:26 +0000 UTC]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-073ba6816aec4f180]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-08714bc3d49e73257]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-021e41c60e9524619]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0ab7380eead9d368e]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-035a4a8564eb5bf8e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08975de3a8b3487f4]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0eac23a80f6e7f302]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bb8bd2035526ed58]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-073386c8a212599ce]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f964419bf7ff82f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0138a448a687f4151]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-01b472ffc7c509517]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0065fba71db9ede92]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d73c5c94bc0c46de]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=k8s-vpc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0deb00bfb11d22021]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0a5e67af7b849da95]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0ee45b89ecb268c9a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0cefe35dca5a0efd0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f72787c313f9df05]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05df3404f19a502ea]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3385609347]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1085117081]
module.aws_static_website.aws_s3_bucket.website_root: Refreshing state... [id=csepulveda.io-root]
module.aws_static_website.aws_s3_bucket.website_redirect: Refreshing state... [id=csepulveda.io-redirect]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-073ba6816aec4f1801080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e09e94a750bc7948]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0249e54818227d53a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fc5c96d2945f1b95]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05567d92b013f4bcc]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1560984072]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1200664204]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-4093119529]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3316967326]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0eac23a80f6e7f3021080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster1]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=cluster120210624003327308700000009]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::107584640829:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/9CF5841646B134138EF413B34DA7D846]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332752150000000b]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=cluster12021062400332747200000000a]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332754270000000d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=cluster120210624003327308700000009-2021062400332752840000000c]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=cluster1-02021062400332766210000000e]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=cluster1-02021062400333852870000000f]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_redirect: Refreshing state... [id=E80BFWFSTH9N8]
module.aws_static_website.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=csepulveda.io-root]
module.aws_static_website.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1GON5LWI0YJQ8]
module.aws_static_website.aws_route53_record.website_cdn_redirect_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_blog.csepulveda.io_A]
module.aws_static_website.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z09309173TX5H4I19KYIU_csepulveda.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.cluster-autoscaler will be created
  + resource "aws_iam_policy" "cluster-autoscaler" {
      + arn         = (known after apply)
      + description = "Allow Pods use autoscaling resources."
      + id          = (known after apply)
      + name        = "EKS-Cluster-Autoscaler"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.autoscaler_role will be created
  + resource "aws_iam_role" "autoscaler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + oidc.eks.us-west-2.amazonaws.com/id/9CF5841646B134138EF413B34DA7D846:sub = [
                                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::107584640829:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/9CF5841646B134138EF413B34DA7D846"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # helm_release.cluster-autoscaler will be created
  + resource "helm_release" "cluster-autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.9.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "cluster1"
        }
      + set {
          + name  = "awsRegion"
          + value = "us-west-2"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.\"eks.amazonaws.com/role-arn\""
          + value = (known after apply)
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "cluster1-02021062400333852870000000f"
      ~ max_size                  = 0 -> 10
      ~ min_size                  = 0 -> 1
        name                      = "cluster1-02021062400333852870000000f"
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```
</details>
*Pusher: @csepulveda, Action: `pull_request`*